Revit 2027 API
PointCloudOverrides.SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) Method
 Assigns override settings to a particular region within a PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPointCloudRegionOverrideSettings(
	ElementId elementId,
	PointCloudOverrideSettings newSettings,
	string regionTag,
	Document doc
)
Public Sub SetPointCloudRegionOverrideSettings (
	elementId As ElementId,
	newSettings As PointCloudOverrideSettings,
	regionTag As String,
	doc As Document
)
public:
void SetPointCloudRegionOverrideSettings(
	ElementId^ elementId,
	PointCloudOverrideSettings^ newSettings,
	String^ regionTag,
	Document^ doc
)
member SetPointCloudRegionOverrideSettings :
        elementId : ElementId *
        newSettings : PointCloudOverrideSettings *
        regionTag : string *
        doc : Document -> unit
Parameters
elementId ElementId
 Id of the element to be overridden.
newSettings PointCloudOverrideSettings
 Override settings to be assigned.
regionTag String
 The tag identifying the particular region within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getRegions.
doc Document
 Document containing the element to be overridden.
Exceptions
Exception | Condition
ArgumentException |  Thrown when supplied regionTag is not empty while doc is NULL
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The override settings are not valid.
See Also
Reference
PointCloudOverrides Class
SetPointCloudRegionOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace